posts/common-lisp/introduccion.org
#+title: Introducción al lenguaje Common Lisp (ahora sí)
#+date: <2023-02-12 dom>

* Introducción

Como ya sabrás, los lenguajes de programación nos sirven para comunicarnos con el ordenador y decirle cómo manipular datos. Es por ello que siempre vale la pena empezar viendo cómo funciona un lenguaje hablando sobre los tipos de datos que podemos manejar en él. Tras esto lo común es ver la sintaxis del lenguaje para realmente decirle a ordenador cómo manipulamos estos datos, pero con Common Lisp eso no va a ocurrir porque los propios datos ya son la sintaxis del lenguaje.

Recordemos que para trabajar con Common Lisp se suele trabajar con un /REPL/.  Este /REPL/ es lo que obtenemos al ejecutar cualquier implementación de Common Lisp. En él introducimos expresiones y el /REPL/ las evalúa y devuelve el resultado. Al principio da la sensación de que sólo sirve para probar expresiones sencillas, pero poco a poco uno va descubriendo su verdadero potencial.

Dicho esto, en esta introducción estaré usando continuamente el /REPL/ para evaluar expresiones de Common Lisp, a no ser que se diga lo contrario.


* Tipos de datos primitivos

Como cualquier otro lenguaje de programación, Common Lisp dispone de los tipos de datos más primitivos. Entre ellos podemos encontrar:

- Números
- Booleanos
- Caracteres y cadenas de texto

Hay muchísimos tipos de datos más que iremos introduciendo poco a poco.

** Números

En cuanto a los números enteros no hay mucho misterio. Se escriben exactamente igual que en cualquier otro lenguaje:

#+begin_src lisp
5    ; El entero 5
-6   ; El entero negativo -6
#+end_src

Lo que quizás no es tan común es que estos números enteros pueden usar, si es necesario, /bignums/. Esto quiere decir que podemos escribir cualquier número sea lo grande que sea y todo seguirá yendo bien. 

#+begin_src lisp
9999999999999999999999999999999999   ; Un número muy grande,
                                     ; pero todo va bien 
#+end_src

Aunque aún no hayamos introducido las funciones, la siguiente expresión ejecuta la función ~+~ (función de suma):

#+begin_src lisp :exports both :eval never-export
(+ 3 4 5)
#+end_src

#+RESULTS:
: 12

Como se puede ver, para ejecutar una función debemos poner entre paréntesis la función (en este caso ~+~) y seguidamente los argumentos (en este caso ~3~, ~4~ y ~5~). Podemos también multiplicar con la función ~*~, dividir con ~/~, y restar con ~-~.

#+begin_src lisp :exports both :eval never-export
(* 9999 9999 99999 999988877 123456 6656) 
#+end_src

#+RESULTS:
: 8215414458948896050459819081728

Estas funciones aceptan cualquier tipo numérico, incluidos los números con coma flotante.

#+begin_src lisp :exports both :eval never-export
(/ 5.0 2.0 2.0)  ; 5.0 / 2.0 / 2.0
#+end_src

#+RESULTS:
: 1.25

Como ya ocurre en otros lenguajes, podemos usar notación científica para denotar números en coma flotante:

#+begin_src lisp :exports both :eval never-export
(- 6.e10 5.6e6)
#+end_src

#+RESULTS:
: 5.9994403e10

Un tipo de dato poco común y que debería estar presente en más lenguajes de programación son las fracciones:

#+begin_src lisp :exports both :eval never-export
(- 8/5 7/8 1/3)  ; 8/5 - 7/8 - 1/3
#+end_src

#+RESULTS:
: 47/120

Common Lisp tiene el tipo ~rational~. No lo confundas con la división que puedes encontrar en otros lenguajes como C++ o Java. Recuerda que para dividir dos números en Common Lisp usamos la expresión ~(/ a b)~ donde ~a~ y ~b~ son dos números. Por otro lado, la expresión ~a/b~ es la fracción ~a~ entre ~b~. Mientras que la división acepta cualquier tipo de número (enteros, fracciones, números con coma flotante), las fracciones sólo pueden formarse a partir de dos enteros.

También podemos usar números complejos. Usamos ~#c(5 1)~, por ejemplo, para denotar al número ~5+i~. Utilizando la función de exponenciación ~expt~ y la variable ~pi~ podemos calcular el valor ~-1~ con la famosa identidad de Euler.

#+begin_src lisp :exports both :eval never-export
(expt 2.718281828459045d0 (* pi #c(0 1)))  ; e^(πi)
#+end_src

#+RESULTS:
: #C(-1.0d0 1.2246467991473532d-16) 

La ~d~ que hay al final del número en coma flotante sirve para indicar que queremos usar doble precisión (~double~). 

Si quieres más información sobre los números en Common Lisp te recomiendo ir al libro [[https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node16.html][Common Lisp the Language]].

Por otro lado, si quieres ver qué operaciones matemáticas existen en Common Lisp puedes visitar el [[http://clhs.lisp.se/Body/12_aa.htm][HyperSpec]].


** Booleanos

No existen unos valores que podamos identificar únicamente como booleanos, sino que Common Lisp hace algo parecido al lenguaje C. En C, el número ~0~ significa falso y cualquier otra cosa significa verdadero. Por su lado, en Common Lisp, ~NIL~ es usado para indicar falsedad y cualquier otra cosa significa verdadero. Aunque, en particular, se usa el valor ~T~ para referirse al valor booleano que indica verdad. Es decir los valores que entran dentro del tipo ~boolean~ estrictamente hablando son:

- ~T~: Verdadero
- ~NIL~: Falso

Como es de esperar tenemos disponibles las funciones que se corresponden con las puertas lógicas:

#+begin_src lisp :exports both :eval never-export
(not nil)
#+end_src

#+RESULTS:
: T

#+begin_src lisp :exports both :eval never-export
(and (or t nil) nil)
#+end_src

#+RESULTS:
: NIL

Quizás te estés preguntando por qué he escrito antes ~NIL~ y en el código he escrito ~nil~. La respuesta es que da igual cuál uses, ambos son equivalentes, pues Common Lisp no distingue entre mayúsculas y minúsculas (/case-insensitive/). Normalmente el código se escribe en minúscula y los resultados se suelen escribir en mayúscula. Lo más seguro es que mezcle ambas formas de escribir los valores, pero debes de saber que al final son equivalentes y da igual cómo lo escribamos.

Si quieres saber más sobre estas operaciones lógicas puedes volver al libro [[https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node75.html][Common Lisp the Language]].


