docs/posts/common-lisp/introduccion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 29-07-2023 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introducción al lenguaje Common Lisp (ahora sí)</title>
<meta name="author" content="Héctor Galbis Sanchis" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/gongzhitaao.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://hectarea1996.github.io/lispylambda/"> UP </a>
 |
 <a accesskey="H" href="https://hectarea1996.github.io/lispylambda/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Introducción al lenguaje Common Lisp (ahora sí)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7649c61">Introducción</a></li>
<li><a href="#org654e1b2">Tipos de datos primitivos</a>
<ul>
<li><a href="#orgb987188">Números</a></li>
<li><a href="#orgcdd1cc0">Booleanos</a></li>
<li><a href="#org62c2326">Caracteres y cadenas de texto</a></li>
</ul>
</li>
<li><a href="#org9c5339b">Control de flujo</a></li>
<li><a href="#orgf45c1f9">Variables</a></li>
<li><a href="#org098e578">Funciones</a></li>
<li><a href="#org8510f02">Hello world!</a></li>
<li><a href="#orge4ffe3c">Conclusión</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7649c61" class="outline-2">
<h2 id="org7649c61">Introducción</h2>
<div class="outline-text-2" id="text-org7649c61">
<p>
Como ya sabrás, los lenguajes de programación nos sirven para comunicarnos con el ordenador y decirle cómo manipular datos. Es por ello que siempre vale la pena empezar viendo cómo funciona un lenguaje hablando sobre los tipos de datos que podemos manejar en él. Tras esto lo común es ver la sintaxis del lenguaje para realmente decirle a ordenador cómo manipulamos estos datos, pero con Common Lisp eso no va a ocurrir porque los propios datos ya son la sintaxis del lenguaje.
</p>

<p>
Recordemos que para trabajar con Common Lisp se suele trabajar con un <i>REPL</i>.  Este <i>REPL</i> es lo que obtenemos al ejecutar cualquier implementación de Common Lisp. En él introducimos expresiones y el <i>REPL</i> las evalúa y devuelve el resultado. Al principio da la sensación de que sólo sirve para probar expresiones sencillas, pero poco a poco uno va descubriendo su verdadero potencial.
</p>

<p>
Dicho esto, en esta introducción estaré usando continuamente el <i>REPL</i> para evaluar expresiones de Common Lisp, a no ser que se diga lo contrario.
</p>
</div>
</div>


<div id="outline-container-org654e1b2" class="outline-2">
<h2 id="org654e1b2">Tipos de datos primitivos</h2>
<div class="outline-text-2" id="text-org654e1b2">
<p>
Como cualquier otro lenguaje de programación, Common Lisp dispone de los tipos de datos más primitivos. Entre ellos podemos encontrar:
</p>

<ul class="org-ul">
<li>Números</li>
<li>Booleanos</li>
<li>Caracteres y cadenas de texto</li>
</ul>

<p>
Hay muchísimos tipos de datos más que iremos introduciendo poco a poco.
</p>
</div>

<div id="outline-container-orgb987188" class="outline-3">
<h3 id="orgb987188">Números</h3>
<div class="outline-text-3" id="text-orgb987188">
<p>
En cuanto a los números enteros no hay mucho misterio. Se escriben exactamente igual que en cualquier otro lenguaje:
</p>

<div class="org-src-container">
<pre class="src src-lisp">5    <span style="color: #6a9955;">; El entero 5</span>
-6   <span style="color: #6a9955;">; El entero negativo -6</span>
</pre>
</div>

<p>
Lo que quizás no es tan común es que estos números enteros pueden usar, si es necesario, <i>bignums</i>. Esto quiere decir que podemos escribir cualquier número sea lo grande que sea y todo seguirá yendo bien. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">9999999999999999999999999999999999   <span style="color: #6a9955;">; Un n&#250;mero muy grande,</span>
                                     <span style="color: #6a9955;">; pero todo va bien </span>
</pre>
</div>

<p>
Aunque aún no hayamos introducido las funciones, la siguiente expresión ejecuta la función <code>+</code> (función de suma):
</p>

<div class="org-src-container">
<pre class="src src-lisp">(+ 3 4 5)
</pre>
</div>

<pre class="example">
12
</pre>


<p>
Como se puede ver, para ejecutar una función debemos poner entre paréntesis la función (en este caso <code>+</code>) y seguidamente los argumentos (en este caso <code>3</code>, <code>4</code> y <code>5</code>). Podemos también multiplicar con la función <code>*</code>, dividir con <code>/</code>, y restar con <code>-</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(* 9999 9999 99999 999988877 123456 6656) 
</pre>
</div>

<pre class="example">
8215414458948896050459819081728
</pre>


<p>
Estas funciones aceptan cualquier tipo numérico, incluidos los números con coma flotante.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(/ 5.0 2.0 2.0)  <span style="color: #6a9955;">; 5.0 / 2.0 / 2.0</span>
</pre>
</div>

<pre class="example">
1.25
</pre>


<p>
Como ya ocurre en otros lenguajes, podemos usar notación científica para denotar números en coma flotante:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(- 6.e10 5.6e6)
</pre>
</div>

<pre class="example">
5.9994403e10
</pre>


<p>
Un tipo de dato poco común y que debería estar presente en más lenguajes de programación son las fracciones:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(- 8/5 7/8 1/3)  <span style="color: #6a9955;">; 8/5 - 7/8 - 1/3</span>
</pre>
</div>

<pre class="example">
47/120
</pre>


<p>
Common Lisp tiene el tipo <code>rational</code>. No lo confundas con la división que puedes encontrar en otros lenguajes como C++ o Java. Recuerda que para dividir dos números en Common Lisp usamos la expresión <code>(/ a b)</code> donde <code>a</code> y <code>b</code> son dos números. Por otro lado, la expresión <code>a/b</code> es la fracción <code>a</code> entre <code>b</code>. Mientras que la división acepta cualquier tipo de número (enteros, fracciones, números con coma flotante), las fracciones sólo pueden formarse a partir de dos enteros.
</p>

<p>
También podemos usar números complejos. Usamos <code>#c(5 1)</code>, por ejemplo, para denotar al número <code>5+i</code>. Utilizando la función de exponenciación <code>expt</code> y la variable <code>pi</code> podemos calcular el valor <code>-1</code> con la famosa identidad de Euler.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(expt 2.718281828459045d0 (* pi #c(0 1)))  <span style="color: #6a9955;">; e^(&#960;i)</span>
</pre>
</div>

<pre class="example">
#C(-1.0d0 1.2246467991473532d-16) 
</pre>


<p>
La <code>d</code> que hay al final del número en coma flotante sirve para indicar que queremos usar doble precisión (<code>double</code>). 
</p>

<p>
Si quieres más información sobre los números en Common Lisp te recomiendo ir al libro <a href="https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node16.html">Common Lisp the Language</a>.
</p>

<p>
Por otro lado, si quieres ver qué operaciones matemáticas existen en Common Lisp puedes visitar el <a href="http://clhs.lisp.se/Body/12_aa.htm">HyperSpec</a>.
</p>
</div>
</div>


<div id="outline-container-orgcdd1cc0" class="outline-3">
<h3 id="orgcdd1cc0">Booleanos</h3>
<div class="outline-text-3" id="text-orgcdd1cc0">
<p>
No existen unos valores que podamos identificar únicamente como booleanos, sino que Common Lisp hace algo parecido al lenguaje C. En C, el número <code>0</code> significa falso y cualquier otra cosa significa verdadero. Por su lado, en Common Lisp, <code>NIL</code> es usado para indicar falsedad y cualquier otra cosa significa verdadero. Aunque, en particular, se usa el valor <code>T</code> para referirse al valor booleano que indica verdad. Es decir los valores que entran dentro del tipo <code>boolean</code> estrictamente hablando son:
</p>

<ul class="org-ul">
<li><code>T</code>: Verdadero</li>
<li><code>NIL</code>: Falso</li>
</ul>

<p>
Como es de esperar tenemos disponibles las funciones que se corresponden con las puertas lógicas:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(not nil)
</pre>
</div>

<pre class="example">
T
</pre>


<div class="org-src-container">
<pre class="src src-lisp">(and (or t nil) nil)
</pre>
</div>

<pre class="example">
NIL
</pre>


<p>
Quizás te estés preguntando por qué he escrito antes <code>NIL</code> y en el código he escrito <code>nil</code>. La respuesta es que da igual cuál uses, ambos son equivalentes, pues Common Lisp no distingue entre mayúsculas y minúsculas (<i>case-insensitive</i>). Normalmente el código se escribe en minúscula y los resultados se suelen escribir en mayúscula. Lo más seguro es que mezcle ambas formas de escribir los valores, pero debes de saber que al final son equivalentes y da igual cómo lo escribamos.
</p>

<p>
Si quieres saber más sobre estas operaciones lógicas puedes volver al libro <a href="https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node75.html">Common Lisp the Language</a>.
</p>
</div>
</div>
