posts/common-lisp/introduccion.org
** Caracteres y cadenas de texto

Los caracteres en Common Lisp se denotan por ~#\~ seguidos del caracter que quieres representar. Por ejemplo, si queremos el caracter ~g~ utilizamos ~#\g~. 

#+begin_src lisp
#\g
#+end_src

Existen un conjunto de 96 caracteres presentes en el estándar de Common Lisp (es decir, cualquier implementación debe tenerlos). Eso quiere decir que existen caracteres que podrían o no estar dependiendo de la implementación que usemos, pero no nos vamos a meter ahí. 

De entre esos 96 caracteres, 2 se refieren al espacio y a la nueva línea. Para referirnos a estos dos caracteres utilizamos lo que se llama un nombre de caracter. En particular, se usa ~#\Space~ y ~#\Newline~ (de nuevo, da igual usar minúsculas o mayúsculas). Puedes encontrar la lista completa de los caracteres en el [[http://www.lispworks.com/documentation/HyperSpec/Body/02_ac.htm][HyperSpec]]. Sin embargo, los nombres de caracteres disponibles están en [[http://www.lispworks.com/documentation/HyperSpec/Body/13_ag.htm][otra sección]]. Recuerda que los únicos nombres de caracter que están presentes en el estándar son los dos primeros (~#\Space~ y ~#\Newline~). 

Tenemos bastantes funciones que trabajan sobre caracteres. Podemos comparar su orden, ver si dos caracteres son iguales, si es mayúscula o minúscula, si es un dígito, etc.

#+begin_src lisp :exports both :eval never-export
(char<= #\a #\h)
#+end_src

#+RESULTS:
: T

#+begin_src lisp :exports both :eval never-export
(char-upcase #\y)
#+end_src

#+RESULTS:
: #\Y

Puedes ver una lista de algunas de estas funciones en el [[http://www.lispworks.com/documentation/HyperSpec/Body/13_aa.htm][HyperSpec]].

Por otro lado tenemos las cadenas de caracteres. Como en otros lenguajes de programación, las cadenas de texto, o strings, son arrays de caracteres. Las cadenas de texto se representan mediante una sucesión de caracteres puestos entre un par de dobles comillas (/"/).

  #+begin_src lisp
"Hola"
  #+end_src

Recordemos que habían dos caracteres 'especiales' con los que nos teníamos que referir con un nombre de caracter: ~#\Space~ y ~#\Newline~. Al igual que no usarías nunca ~#\a~ para escribir una ~a~ en un string, tampoco vas a usar ~#\Space~ y ~#\Newline~ para insertar un espacio o una nueva línea en un string. Y tampoco podemos usar ~\b~ o ~\n~. Lo que tenemos que hacer es insertar literalmente un espacio (usando la barra espaciadora) o una nueva línea (usando la tecla /Enter/).

#+begin_src lisp :exports both :eval never-export
(string-upcase "Pongo espacios entre la palabras.
Y una nueva linea entre frases.")
#+end_src

#+RESULTS:
: "PONGO ESPACIOS ENTRE LA PALABRAS.
: Y UNA NUEVA LINEA ENTRE FRASES."

Al igual que con los caracteres, existen [[http://www.lispworks.com/documentation/HyperSpec/Body/f_stg_up.htm][algunas funciones que manipulan los strings]], y [[http://www.lispworks.com/documentation/HyperSpec/Body/f_stgeq_.htm][otras funciones que nos dan información]]. También podemos concatenar varios strings:

#+begin_src lisp :exports both :eval never-export
(concatenate 'string "Hola " "mundo")
#+end_src

#+RESULTS:
: "Hola mundo"


* Control de flujo

La operación más primitiva de control de flujo en Common Lisp es ~if~. Como en cualquier otro lenguaje de programación, recibe una condición, y dependiendo de si esa condición es verdadera o falsa ejecutará una expresión u otra.

#+begin_src lisp
(if condicion 
  entonces 
  en-otro-caso)
#+end_src

Algo importante a tener en cuenta es que cualquier expresión de Common Lisp debe devolver algo, e ~if~ no es una excepción. En particular, ~if~ devolverá el valor que devuelva la expresión ~entonces~ o ~en-otro-caso~ dependiendo del valor de ~condicion~.

#+begin_src lisp :exports both :eval never-export
(if (> 5 0)
  "5 es positivo"
  "5 no es positivo")
#+end_src

#+RESULTS:
: "5 es positivo"

En este caso se ha evaluado la expresión ~(> 5 0)~ que devuelve ~T~, y por tanto se devuelve la expresión ~"5 es positivo"~ que está situado en el lugar del ~then~.

A partir de ~if~ se construye ~cond~, que es la versión ~if-else-if-else-if~ de otros lenguajes. 

#+begin_src lisp
(cond
  (cond1 expr1)
  (cond2 expr2)
  (cond3 expr3)
  ...)
#+end_src

Es decir, podríamos usar ~if~ para ver si un número es positivo, negativo o cero de esta forma:

#+begin_src lisp :exports both :eval never-export
(if (> -4 0)
  "-4 es positivo"
  (if (< -4 0)
    "-4 es negativo"
    "-4 es cero"))
#+end_src

#+RESULTS:
: "-4 es negativo"

Pero es más cómodo usar ~cond~:

#+begin_src lisp :exports both :eval never-export
(cond
  ((> 0 0) "0 es positivo")
  ((< 0 0) "0 es negativo")
  (t       "0 es cero"))
#+end_src

#+RESULTS:
: "0 es cero"

En la expresión ~cond~ se van evaluando las condiciones, y en el momento que se encuentre algo que sea verdadero (es decir, que devuelva ~T~) devuelve la expresión asociada a dicha condición. En este caso, se usa como tercera condición el valor ~T~, de esta forma creamos un 'en-otro-caso' si el resto de condiciones falla.

Ahora es cuando debería hablar de bucles ~while~ y ~for~, pero en Common Lisp no hay. Y antes de que te lleves las manos a la cabeza te diré que hay algo muchísimo mejor: la expresión ~loop~. Sin exagerar, engloba todas las expresiones típicas de bucles como ~while~, ~for~, ~do-while~, ~repeat~, ... y añade incluso más potencia. Es un pelín compleja y se merece un post entero para ella sola. Aun así, si tienes curiosidad, puedes encontrar su funcionamiento explicado con bastante detalle en el libro [[https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node235.html][Common Lisp the Language]].

