docs/posts/common-lisp/introduccion.html


<div id="outline-container-org62c2326" class="outline-3">
<h3 id="org62c2326">Caracteres y cadenas de texto</h3>
<div class="outline-text-3" id="text-org62c2326">
<p>
Los caracteres en Common Lisp se denotan por <code>#\</code> seguidos del caracter que quieres representar. Por ejemplo, si queremos el caracter <code>g</code> utilizamos <code>#\g</code>. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">#\g
</pre>
</div>

<p>
Existen un conjunto de 96 caracteres presentes en el estándar de Common Lisp (es decir, cualquier implementación debe tenerlos). Eso quiere decir que existen caracteres que podrían o no estar dependiendo de la implementación que usemos, pero no nos vamos a meter ahí. 
</p>

<p>
De entre esos 96 caracteres, 2 se refieren al espacio y a la nueva línea. Para referirnos a estos dos caracteres utilizamos lo que se llama un nombre de caracter. En particular, se usa <code>#\Space</code> y <code>#\Newline</code> (de nuevo, da igual usar minúsculas o mayúsculas). Puedes encontrar la lista completa de los caracteres en el <a href="http://www.lispworks.com/documentation/HyperSpec/Body/02_ac.htm">HyperSpec</a>. Sin embargo, los nombres de caracteres disponibles están en <a href="http://www.lispworks.com/documentation/HyperSpec/Body/13_ag.htm">otra sección</a>. Recuerda que los únicos nombres de caracter que están presentes en el estándar son los dos primeros (<code>#\Space</code> y <code>#\Newline</code>). 
</p>

<p>
Tenemos bastantes funciones que trabajan sobre caracteres. Podemos comparar su orden, ver si dos caracteres son iguales, si es mayúscula o minúscula, si es un dígito, etc.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(char&lt;= #\a #\h)
</pre>
</div>

<pre class="example">
T
</pre>


<div class="org-src-container">
<pre class="src src-lisp">(char-upcase #\y)
</pre>
</div>

<pre class="example">
#\Y
</pre>


<p>
Puedes ver una lista de algunas de estas funciones en el <a href="http://www.lispworks.com/documentation/HyperSpec/Body/13_aa.htm">HyperSpec</a>.
</p>

<p>
Por otro lado tenemos las cadenas de caracteres. Como en otros lenguajes de programación, las cadenas de texto, o strings, son arrays de caracteres. Las cadenas de texto se representan mediante una sucesión de caracteres puestos entre un par de dobles comillas (<i>"</i>).
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ce9178;">"Hola"</span>
</pre>
</div>

<p>
Recordemos que habían dos caracteres 'especiales' con los que nos teníamos que referir con un nombre de caracter: <code>#\Space</code> y <code>#\Newline</code>. Al igual que no usarías nunca <code>#\a</code> para escribir una <code>a</code> en un string, tampoco vas a usar <code>#\Space</code> y <code>#\Newline</code> para insertar un espacio o una nueva línea en un string. Y tampoco podemos usar <code>\b</code> o <code>\n</code>. Lo que tenemos que hacer es insertar literalmente un espacio (usando la barra espaciadora) o una nueva línea (usando la tecla <i>Enter</i>).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(string-upcase <span style="color: #ce9178;">"Pongo espacios entre la palabras.</span>
<span style="color: #ce9178;">Y una nueva linea entre frases."</span>)
</pre>
</div>

<pre class="example">
"PONGO ESPACIOS ENTRE LA PALABRAS.
Y UNA NUEVA LINEA ENTRE FRASES."
</pre>


<p>
Al igual que con los caracteres, existen <a href="http://www.lispworks.com/documentation/HyperSpec/Body/f_stg_up.htm">algunas funciones que manipulan los strings</a>, y <a href="http://www.lispworks.com/documentation/HyperSpec/Body/f_stgeq_.htm">otras funciones que nos dan información</a>. También podemos concatenar varios strings:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(concatenate 'string <span style="color: #ce9178;">"Hola "</span> <span style="color: #ce9178;">"mundo"</span>)
</pre>
</div>

<pre class="example">
"Hola mundo"
</pre>
</div>
</div>
</div>


<div id="outline-container-org9c5339b" class="outline-2">
<h2 id="org9c5339b">Control de flujo</h2>
<div class="outline-text-2" id="text-org9c5339b">
<p>
La operación más primitiva de control de flujo en Common Lisp es <code>if</code>. Como en cualquier otro lenguaje de programación, recibe una condición, y dependiendo de si esa condición es verdadera o falsa ejecutará una expresión u otra.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">if</span> condicion 
  entonces 
  en-otro-caso)
</pre>
</div>

<p>
Algo importante a tener en cuenta es que cualquier expresión de Common Lisp debe devolver algo, e <code>if</code> no es una excepción. En particular, <code>if</code> devolverá el valor que devuelva la expresión <code>entonces</code> o <code>en-otro-caso</code> dependiendo del valor de <code>condicion</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">if</span> (&gt; 5 0)
  <span style="color: #ce9178;">"5 es positivo"</span>
  <span style="color: #ce9178;">"5 no es positivo"</span>)
</pre>
</div>

<pre class="example">
"5 es positivo"
</pre>


<p>
En este caso se ha evaluado la expresión <code>(&gt; 5 0)</code> que devuelve <code>T</code>, y por tanto se devuelve la expresión <code>"5 es positivo"</code> que está situado en el lugar del <code>then</code>.
</p>

<p>
A partir de <code>if</code> se construye <code>cond</code>, que es la versión <code>if-else-if-else-if</code> de otros lenguajes. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">cond</span>
  (cond1 expr1)
  (cond2 expr2)
  (cond3 expr3)
  ...)
</pre>
</div>

<p>
Es decir, podríamos usar <code>if</code> para ver si un número es positivo, negativo o cero de esta forma:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">if</span> (&gt; -4 0)
  <span style="color: #ce9178;">"-4 es positivo"</span>
  (<span style="color: #569cd6;">if</span> (&lt; -4 0)
    <span style="color: #ce9178;">"-4 es negativo"</span>
    <span style="color: #ce9178;">"-4 es cero"</span>))
</pre>
</div>

<pre class="example">
"-4 es negativo"
</pre>


<p>
Pero es más cómodo usar <code>cond</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">cond</span>
  ((&gt; 0 0) <span style="color: #ce9178;">"0 es positivo"</span>)
  ((&lt; 0 0) <span style="color: #ce9178;">"0 es negativo"</span>)
  (t       <span style="color: #ce9178;">"0 es cero"</span>))
</pre>
</div>

<pre class="example">
"0 es cero"
</pre>


<p>
En la expresión <code>cond</code> se van evaluando las condiciones, y en el momento que se encuentre algo que sea verdadero (es decir, que devuelva <code>T</code>) devuelve la expresión asociada a dicha condición. En este caso, se usa como tercera condición el valor <code>T</code>, de esta forma creamos un 'en-otro-caso' si el resto de condiciones falla.
</p>

<p>
Ahora es cuando debería hablar de bucles <code>while</code> y <code>for</code>, pero en Common Lisp no hay. Y antes de que te lleves las manos a la cabeza te diré que hay algo muchísimo mejor: la expresión <code>loop</code>. Sin exagerar, engloba todas las expresiones típicas de bucles como <code>while</code>, <code>for</code>, <code>do-while</code>, <code>repeat</code>, &#x2026; y añade incluso más potencia. Es un pelín compleja y se merece un post entero para ella sola. Aun así, si tienes curiosidad, puedes encontrar su funcionamiento explicado con bastante detalle en el libro <a href="https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node235.html">Common Lisp the Language</a>.
</p>
</div>
</div>
