posts/common-lisp/introduccion.org
* Variables

Las variables son una de las herramientas más básicas de la programación que nos permiten abstraer información. Dado un objeto relativamente complejo, podemos darle un nombre y así poder usarlo en cualquier otro momento.

Para crear variables globales podemos usar ~defvar~, ~defparameter~ y ~defconstant~ (entre otros un poco más raros). La mayor diferencia entre estas 3 expresiones es qué ocurre cuando reevaluamos la expresión con la misma variable pero con un valor diferente. Pero por ahora, nos quedaremos sólo con ~defvar~.

  #+begin_src lisp :exports both :eval never-export
(defvar miVariable 10)
  #+end_src

  #+RESULTS:
  : MIVARIABLE

Recuerda que cualquier expresión de Common Lisp debe devolver algo. En este caso se retorna un símbolo, algo que veremos en otro momento. Por ahora, se ha definido la variable ~miVariable~ y ya podemos usarla como queramos. 

#+begin_src lisp :exports both :eval never-export
(+ miVariable 5)
#+end_src

#+RESULTS:
: 15

Otro ejemplo:

#+begin_src lisp :exports both :eval never-export
(defvar otraVariable (+ miVariable 2))

(/ miVariable otraVariable)  ; 10/12
#+end_src

#+RESULTS:
: 5/6

En cuanto a las variables locales, hay que pensar que la localidad depende de algo. En lenguajes como C++ o Java las variables locales suelen serlo respecto de una función. Es decir, esa variable sólo puedes usarla dentro de la función. En Common Lisp es un poco diferente. Aquí, tenemos un poco más de control sobre cuándo se puede o no usar una variable. En particular, una variable (normalmente) será local con respecto a la expresión ~let~. 

#+begin_src lisp :exports both :eval never-export
(let ((saludo "Hola")
      (nombre "Juan"))
  (concatenate 'string saludo ", " nombre "."))
#+end_src

#+RESULTS:
: "Hola, Juan."

Una vez finaliza ~let~, las variables ~saludo~ y ~nombre~ dejan de existir (a no ser que todo el ~let~ esté dentro de otro ~let~ con esas mismas variables o existan variables globales con esos nombres). Si ya existían variables con esos nombres, lo que hace ~let~ es ensombrecerlas (/shadowing/). Por ejemplo, recuerda que antes hemos definido la variable ~miVariable~.

#+begin_src lisp :exports both :eval never-export
miVariable
#+end_src

#+RESULTS:
: 10

Usando ~let~ podemos ensombrecer la variable global:

#+begin_src lisp :exports both :eval never-export
(let ((miVariable "Ahora es un string"))
  (string-upcase miVariable))
#+end_src

#+RESULTS:
: "AHORA ES UN STRING"

Una vez finaliza la expresión ~let~ la variable global ~miVariable~ deja de estar ensombrecida y vuelve a ser disponible con su valor original:

#+begin_src lisp :exports both :eval never-export
miVariable
#+end_src

#+RESULTS:
: 10

* Funciones

Si con las variables podemos dar nombre a los objetos, con las funciones le damos nombre a una serie de expresiones. Ya hemos usado algunas funciones como ~+~, ~-~, ~concatenate~ o ~string-upcase~. Pero también estamos interesados en crear nuestras propias funciones. Para ello utilizamos ~defun~.

#+begin_src lisp :exports both :eval never-export
(defun suma2 (n)
  (+ n 2))
#+end_src

#+RESULTS:
: SUMA2

Al igual que pasaba con ~defvar~, ~defun~ también devuelve el símbolo que representa a nuestra función. Cuando usamos ~defun~ debemos indicar el nombre de la función, que en este caso es ~suma2~, unos argumentos de entrada como ~n~, y luego el cuerpo de la función. En el cuerpo podemos escribir la cantidad de expresiones que queramos. Además, el valor devuelto por la función será el valor devuelto por la última expresión del cuerpo de la función.

#+begin_src lisp :exports both :eval never-export
(defun saludar (nombre)
  (let ((saludo (concatenate 'string "Hola, " nombre ".")))
    (princ saludo))
  nombre) 
#+end_src

#+RESULTS:
: SALUDAR

En la función saludar recibimos un ~nombre~ con el que creamos un ~saludo~. Imprimimos el saludo con la función ~princ~ (también existe la función ~print~). Por último, escribimos ~nombre~ al final de la función para devolver el nombre que hemos recibido.

#+begin_src lisp :exports both :eval never-export
(saludar "Juan")
#+end_src

#+RESULTS:
: Hola, Juan.
: "Juan"

En los resultados, primero se muestra qué se imprime por pantalla y luego se muestra el valor devuelto por la función.

En otro momento veremos cómo sacarle el máximo provecho a las funciones, pues es posible indicar argumentos opcionales, e incluso una cantidad variable de argumentos. 


