docs/posts/common-lisp/introduccion.html

<div id="outline-container-orgf45c1f9" class="outline-2">
<h2 id="orgf45c1f9">Variables</h2>
<div class="outline-text-2" id="text-orgf45c1f9">
<p>
Las variables son una de las herramientas más básicas de la programación que nos permiten abstraer información. Dado un objeto relativamente complejo, podemos darle un nombre y así poder usarlo en cualquier otro momento.
</p>

<p>
Para crear variables globales podemos usar <code>defvar</code>, <code>defparameter</code> y <code>defconstant</code> (entre otros un poco más raros). La mayor diferencia entre estas 3 expresiones es qué ocurre cuando reevaluamos la expresión con la misma variable pero con un valor diferente. Pero por ahora, nos quedaremos sólo con <code>defvar</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">defvar</span> <span style="color: #9cdcfe;">miVariable</span> 10)
</pre>
</div>

<pre class="example">
MIVARIABLE
</pre>


<p>
Recuerda que cualquier expresión de Common Lisp debe devolver algo. En este caso se retorna un símbolo, algo que veremos en otro momento. Por ahora, se ha definido la variable <code>miVariable</code> y ya podemos usarla como queramos. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(+ miVariable 5)
</pre>
</div>

<pre class="example">
15
</pre>


<p>
Otro ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">defvar</span> <span style="color: #9cdcfe;">otraVariable</span> (+ miVariable 2))

(/ miVariable otraVariable)  <span style="color: #6a9955;">; 10/12</span>
</pre>
</div>

<pre class="example">
5/6
</pre>


<p>
En cuanto a las variables locales, hay que pensar que la localidad depende de algo. En lenguajes como C++ o Java las variables locales suelen serlo respecto de una función. Es decir, esa variable sólo puedes usarla dentro de la función. En Common Lisp es un poco diferente. Aquí, tenemos un poco más de control sobre cuándo se puede o no usar una variable. En particular, una variable (normalmente) será local con respecto a la expresión <code>let</code>. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">let</span> ((saludo <span style="color: #ce9178;">"Hola"</span>)
      (nombre <span style="color: #ce9178;">"Juan"</span>))
  (concatenate 'string saludo <span style="color: #ce9178;">", "</span> nombre <span style="color: #ce9178;">"."</span>))
</pre>
</div>

<pre class="example">
"Hola, Juan."
</pre>


<p>
Una vez finaliza <code>let</code>, las variables <code>saludo</code> y <code>nombre</code> dejan de existir (a no ser que todo el <code>let</code> esté dentro de otro <code>let</code> con esas mismas variables o existan variables globales con esos nombres). Si ya existían variables con esos nombres, lo que hace <code>let</code> es ensombrecerlas (<i>shadowing</i>). Por ejemplo, recuerda que antes hemos definido la variable <code>miVariable</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">miVariable
</pre>
</div>

<pre class="example">
10
</pre>


<p>
Usando <code>let</code> podemos ensombrecer la variable global:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">let</span> ((miVariable <span style="color: #ce9178;">"Ahora es un string"</span>))
  (string-upcase miVariable))
</pre>
</div>

<pre class="example">
"AHORA ES UN STRING"
</pre>


<p>
Una vez finaliza la expresión <code>let</code> la variable global <code>miVariable</code> deja de estar ensombrecida y vuelve a ser disponible con su valor original:
</p>

<div class="org-src-container">
<pre class="src src-lisp">miVariable
</pre>
</div>

<pre class="example">
10
</pre>
</div>
</div>

<div id="outline-container-org098e578" class="outline-2">
<h2 id="org098e578">Funciones</h2>
<div class="outline-text-2" id="text-org098e578">
<p>
Si con las variables podemos dar nombre a los objetos, con las funciones le damos nombre a una serie de expresiones. Ya hemos usado algunas funciones como <code>+</code>, <code>-</code>, <code>concatenate</code> o <code>string-upcase</code>. Pero también estamos interesados en crear nuestras propias funciones. Para ello utilizamos <code>defun</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">defun</span> <span style="color: #dcdcaa;">suma2</span> (n)
  (+ n 2))
</pre>
</div>

<pre class="example">
SUMA2
</pre>


<p>
Al igual que pasaba con <code>defvar</code>, <code>defun</code> también devuelve el símbolo que representa a nuestra función. Cuando usamos <code>defun</code> debemos indicar el nombre de la función, que en este caso es <code>suma2</code>, unos argumentos de entrada como <code>n</code>, y luego el cuerpo de la función. En el cuerpo podemos escribir la cantidad de expresiones que queramos. Además, el valor devuelto por la función será el valor devuelto por la última expresión del cuerpo de la función.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #569cd6;">defun</span> <span style="color: #dcdcaa;">saludar</span> (nombre)
  (<span style="color: #569cd6;">let</span> ((saludo (concatenate 'string <span style="color: #ce9178;">"Hola, "</span> nombre <span style="color: #ce9178;">"."</span>)))
    (princ saludo))
  nombre) 
</pre>
</div>

<pre class="example">
SALUDAR
</pre>


<p>
En la función saludar recibimos un <code>nombre</code> con el que creamos un <code>saludo</code>. Imprimimos el saludo con la función <code>princ</code> (también existe la función <code>print</code>). Por último, escribimos <code>nombre</code> al final de la función para devolver el nombre que hemos recibido.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(saludar <span style="color: #ce9178;">"Juan"</span>)
</pre>
</div>

<pre class="example">
Hola, Juan.
"Juan"
</pre>


<p>
En los resultados, primero se muestra qué se imprime por pantalla y luego se muestra el valor devuelto por la función.
</p>

<p>
En otro momento veremos cómo sacarle el máximo provecho a las funciones, pues es posible indicar argumentos opcionales, e incluso una cantidad variable de argumentos. 
</p>
</div>
</div>
