posts/common-lisp/introduccion.org
* Hello world!

Para terminar vamos a ver cómo podemos hacer un programa /Hello World/. Es claro que si en el /REPL/ de /SLIME/ escribimos simplemente ~"Hello world"~, el propio /REPL/ nos mostrará lo mismo.

#+begin_src lisp :exports both :eval never-export
"Hello world"
#+end_src

#+RESULTS:
: "Hello world"

Pero eso no es lo que queremos. Un programa /Hello World/ requiere al menos que escribamos el código en un fichero, que podamos cargar dicho fichero y así poder ejecutar una función que nos imprima ~"Hello World"~. Pues eso es exactamente lo que vamos a hacer ahora.

Los programas de Common Lisp se escriben en ficheros con extensión '/.lisp/'. Vamos entonces a crear un fichero en el directorio /HOME/ (​~​) llamado '/hello-world.lisp/'. En él, escribiremos la definición de una función ~main~ que imprimirá ~"Hello world!"~.

#+begin_src lisp
;;; ~/hellow-world.lisp

(defun main ()
  (princ "Hello world!"))
#+end_src

Ahora sólo falta cargar el fichero. Para ello usamos la función ~load~ desde nuestro /REPL/ (sí, todo se hace desde el /REPL/).

#+begin_src lisp :exports both :eval never-export
(load "~/hello-world.lisp")
#+end_src

#+RESULTS:
: T

Si la función ~load~ devuelve el valor ~T~, significa que todo ha ido bien. Eso, además, quiere decir que la función ~main~ ya se puede usar.

#+begin_src lisp :exports both :eval never-export
(main)
#+end_src

#+RESULTS:
: Hello world!
: "Hello world!"

Quizás te sorprendas de que se haya impreso dos veces ~Hello world!~. Eso es porque la función ~princ~, que también tiene que devolver algo, devuelve el objeto que ha recibido. En este caso, ~princ~ recibe el objeto ~"Hello world!"~​, por lo que primero se imprime ~Hello world!~, y luego se muestra el valor devuelto por la función ~main~ que es el valor devuelto por ~princ~, es decir, ~"Hello world!"~.

Podríamos ir un paso más y generar un ejecutable, aunque es un pelín más complicado. Pero qué carajos, vamos a hacerlo.

Primero hay que tener en cuenta que en el estandar no se habla nada sobre ejecutables, por lo que su creación debe estar soportada por las implementaciones. Es más, cada implementación lo hará de una manera diferente. En el caso de SBCL, la creación de un ejecutable pasa por usar la función ~sb-ext:save-lisp-and-die~. ¡Pero cuidado! Esta función debe ejecutarse cuando no hay hilos extra ejecutándose. Y, ¿cuál es el problema? SLIME ejecuta varios hilos al mismo tiempo. Es decir, no podemos usar esta función en Emacs con SLIME. Pero la solución es sencilla: No usar Emacs, sino usar la consola de comandos.

Abre la consola de comandos y ejecuta SBCL:

#+begin_src bash
sbcl
#+end_src

Se te abrirá un /REPL/ en la terminal. Primero, como hemos creado una sesión nueva de Common Lisp, nuestra función ~main~ no está disponible. Así que, de nuevo, cargamos el fichero.

#+begin_src lisp :exports both :eval never-export
(load "~/hello-world.lisp")
#+end_src

#+RESULTS:
: T

Por si acaso, comprueba que ya está disponible usándola:

#+begin_src lisp :exports both :eval never-export
(main)
#+end_src

#+RESULTS:
: Hello world!
: "Hello world!"

Si todo ha ido bien, ya podemos crear el ejecutable:

#+begin_src lisp
(sb-ext:save-lisp-and-die "hello-world.out" 
                          :toplevel #'main 
                          :executable t)
#+end_src

El primer argumento es el nombre del nuevo fichero que queremos generar. El resto de argumentos son conocidos como /keyword arguments/. Cada argumento empezando por '~:~', como ~:toplevel~ es un /keyword./ Y el valor que le sucede es el valor asociado a ese /keyword/, en este caso, ~#'main~. Con el /keyword argument/ ~:toplevel~ indicamos la función que queremos que se llame cuando ejecutemos el ejecutable '/~​/​hello-world.out/'. Por último, con el /keyword argument/ ~:executable~ indicamos si queremos que se cree un ejecutable, por eso le pasamos el valor ~T~.

Cuando ejecutes esta función, la sesión de Common Lisp se termina. Es decir, se cierra el /REPL/ y volverás a la entrada de comandos de la terminal. Sólo queda probar nuestro programa:

#+begin_src bash :exports both :eval never-export
./hello-world.out
#+end_src

#+RESULTS:
: Hello world!

* Conclusión

Con este post hemos echado un vistazo general a lo más básico de Common Lisp: Números, booleanos, variables, ... Pero no te relajes porque esto escala muy rápido. 

:D
