docs/posts/common-lisp/introduccion.html


<div id="outline-container-org8510f02" class="outline-2">
<h2 id="org8510f02">Hello world!</h2>
<div class="outline-text-2" id="text-org8510f02">
<p>
Para terminar vamos a ver cómo podemos hacer un programa <i>Hello World</i>. Es claro que si en el <i>REPL</i> de <i>SLIME</i> escribimos simplemente <code>"Hello world"</code>, el propio <i>REPL</i> nos mostrará lo mismo.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ce9178;">"Hello world"</span>
</pre>
</div>

<pre class="example">
"Hello world"
</pre>


<p>
Pero eso no es lo que queremos. Un programa <i>Hello World</i> requiere al menos que escribamos el código en un fichero, que podamos cargar dicho fichero y así poder ejecutar una función que nos imprima <code>"Hello World"</code>. Pues eso es exactamente lo que vamos a hacer ahora.
</p>

<p>
Los programas de Common Lisp se escriben en ficheros con extensión '<i>.lisp</i>'. Vamos entonces a crear un fichero en el directorio <i>HOME</i> (​~​) llamado '<i>hello-world.lisp</i>'. En él, escribiremos la definición de una función <code>main</code> que imprimirá <code>"Hello world!"</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #6a9955;">;;; </span><span style="color: #6a9955;">~/hellow-world.lisp</span>

(<span style="color: #569cd6;">defun</span> <span style="color: #dcdcaa;">main</span> ()
  (princ <span style="color: #ce9178;">"Hello world!"</span>))
</pre>
</div>

<p>
Ahora sólo falta cargar el fichero. Para ello usamos la función <code>load</code> desde nuestro <i>REPL</i> (sí, todo se hace desde el <i>REPL</i>).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(load <span style="color: #ce9178;">"~/hello-world.lisp"</span>)
</pre>
</div>

<pre class="example">
T
</pre>


<p>
Si la función <code>load</code> devuelve el valor <code>T</code>, significa que todo ha ido bien. Eso, además, quiere decir que la función <code>main</code> ya se puede usar.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(main)
</pre>
</div>

<pre class="example">
Hello world!
"Hello world!"
</pre>


<p>
Quizás te sorprendas de que se haya impreso dos veces <code>Hello world!</code>. Eso es porque la función <code>princ</code>, que también tiene que devolver algo, devuelve el objeto que ha recibido. En este caso, <code>princ</code> recibe el objeto <code>"Hello world!"</code>​, por lo que primero se imprime <code>Hello world!</code>, y luego se muestra el valor devuelto por la función <code>main</code> que es el valor devuelto por <code>princ</code>, es decir, <code>"Hello world!"</code>.
</p>

<p>
Podríamos ir un paso más y generar un ejecutable, aunque es un pelín más complicado. Pero qué carajos, vamos a hacerlo.
</p>

<p>
Primero hay que tener en cuenta que en el estandar no se habla nada sobre ejecutables, por lo que su creación debe estar soportada por las implementaciones. Es más, cada implementación lo hará de una manera diferente. En el caso de SBCL, la creación de un ejecutable pasa por usar la función <code>sb-ext:save-lisp-and-die</code>. ¡Pero cuidado! Esta función debe ejecutarse cuando no hay hilos extra ejecutándose. Y, ¿cuál es el problema? SLIME ejecuta varios hilos al mismo tiempo. Es decir, no podemos usar esta función en Emacs con SLIME. Pero la solución es sencilla: No usar Emacs, sino usar la consola de comandos.
</p>

<p>
Abre la consola de comandos y ejecuta SBCL:
</p>

<div class="org-src-container">
<pre class="src src-bash">sbcl
</pre>
</div>

<p>
Se te abrirá un <i>REPL</i> en la terminal. Primero, como hemos creado una sesión nueva de Common Lisp, nuestra función <code>main</code> no está disponible. Así que, de nuevo, cargamos el fichero.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(load <span style="color: #ce9178;">"~/hello-world.lisp"</span>)
</pre>
</div>

<pre class="example">
T
</pre>


<p>
Por si acaso, comprueba que ya está disponible usándola:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(main)
</pre>
</div>

<pre class="example">
Hello world!
"Hello world!"
</pre>


<p>
Si todo ha ido bien, ya podemos crear el ejecutable:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(sb-ext:save-lisp-and-die <span style="color: #ce9178;">"hello-world.out"</span> 
                          <span style="color: #c586c0;">:toplevel</span> #'main 
                          <span style="color: #c586c0;">:executable</span> t)
</pre>
</div>

<p>
El primer argumento es el nombre del nuevo fichero que queremos generar. El resto de argumentos son conocidos como <i>keyword arguments</i>. Cada argumento empezando por '<code>:</code>', como <code>:toplevel</code> es un <i>keyword.</i> Y el valor que le sucede es el valor asociado a ese <i>keyword</i>, en este caso, <code>#'main</code>. Con el <i>keyword argument</i> <code>:toplevel</code> indicamos la función que queremos que se llame cuando ejecutemos el ejecutable '<i>~​/​hello-world.out</i>'. Por último, con el <i>keyword argument</i> <code>:executable</code> indicamos si queremos que se cree un ejecutable, por eso le pasamos el valor <code>T</code>.
</p>

<p>
Cuando ejecutes esta función, la sesión de Common Lisp se termina. Es decir, se cierra el <i>REPL</i> y volverás a la entrada de comandos de la terminal. Sólo queda probar nuestro programa:
</p>

<div class="org-src-container">
<pre class="src src-bash">./hello-world.out
</pre>
</div>

<pre class="example">
Hello world!
</pre>
</div>
</div>

<div id="outline-container-orge4ffe3c" class="outline-2">
<h2 id="orge4ffe3c">Conclusión</h2>
<div class="outline-text-2" id="text-orge4ffe3c">
<p>
Con este post hemos echado un vistazo general a lo más básico de Common Lisp: Números, booleanos, variables, &#x2026; Pero no te relajes porque esto escala muy rápido. 
</p>

<p>
:D
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="https://hectarea1996.github.io/lispylambda/">UP</a> | <a href="https://hectarea1996.github.io/lispylambda/">HOME</a></p><p></p><p>Autor: Héctor Galbis Sanchis <<a href="mailto:hectometrocuadrado@gmail.com">hectometrocuadrado@gmail.com</a>></p><p>Última edición: 29-07-2023</p>
</div>
</body>
</html>
